debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r2/eu-smoke-console.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://35.244.162.92.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r2/eu-smoke-metrics.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://35.244.162.92.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103220.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r2/eu-smoke-metrics.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103220.json --env K6_SCENARIO=smoke --env BASE_URL=https://35.244.162.92.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu-r2/eu-smoke-metrics.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T10:32:20Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:32:20Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T10:32:20Z" level=info msg="Base URL: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:32:20Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
smoke   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  30.0s/30s

running (0m31.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m32.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:32:53Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:32:53Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T10:32:53Z" level=info msg="Target: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:32:53Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T10:32:53Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✗ route: status 200 or 422
        ↳  0% — ✓ 0 / ✗ 3

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ journey: create

       ✗ journey create: status 201 or 422
        ↳  0% — ✓ 0 / ✗ 3
       ✓ journey create: not 5xx (except 503)

     █ notifications: list

       ✓ notifications: status 200

     █ notifications: mark all read

       ✓ mark-read: status 200 or 204

   ✓ auth_success...................: 100.00% ✓ 9        ✗ 0  
   ✓ capacity_check_duration........: avg=201.85ms min=16ms     med=224ms    max=270ms    p(90)=250.8ms  p(95)=260.39ms
     checks.........................: 90.62%  ✓ 58       ✗ 6  
     data_received..................: 315 kB  9.7 kB/s
     data_sent......................: 15 kB   464 B/s
     group_duration.................: avg=162.61ms min=5.99ms   med=118.07ms max=645.79ms p(90)=385.78ms p(95)=407.16ms
     http_req_blocked...............: avg=274.6µs  min=325ns    med=713ns    max=6.81ms   p(90)=1.05µs   p(95)=1.27µs  
     http_req_connecting............: avg=33µs     min=0s       med=0s       max=1.02ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=158.27ms min=5.17ms   med=76.89ms  max=645.52ms p(90)=384.74ms p(95)=405.56ms
       { expected_response:true }...: avg=180.97ms min=5.17ms   med=219.25ms max=645.52ms p(90)=387.61ms p(95)=410.86ms
   ✗ http_req_failed................: 13.04%  ✓ 6        ✗ 40 
     http_req_receiving.............: avg=51.82ms  min=91.69µs  med=131.16µs max=256.31ms p(90)=210.44ms p(95)=214.51ms
     http_req_sending...............: avg=122.29µs min=56.97µs  med=109.22µs max=226.57µs p(90)=182.74µs p(95)=198.88µs
     http_req_tls_handshaking.......: avg=210.33µs min=0s       med=0s       max=5.1ms    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=106.32ms min=4.85ms   med=16.75ms  max=645.3ms  p(90)=384.45ms p(95)=405.21ms
     http_reqs......................: 46      1.422193/s
     iteration_duration.............: avg=2.93s    min=174.96µs med=2.64s    max=7.31s    p(90)=6.79s    p(95)=7.05s   
     iterations.....................: 9       0.278255/s
   ✗ journey_create_success.........: 0.00%   ✓ 0        ✗ 3  
   ✓ route_compute_duration.........: avg=7.33ms   min=7ms      med=7ms      max=8ms      p(90)=7.8ms    p(95)=7.9ms   
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m32.3s), 0/1 VUs, 9 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:32:53Z" level=error msg="thresholds on metrics 'http_req_failed, journey_create_success' have been crossed"